<template>
    <div class="index">
        <h2>Newsnippet 서비스 이용약관은 다음과 같은 내용을 담고 있습니다.</h2>
        <p><br>Newsnippet 서비스를 이용해 주셔서 감사합니다. <br>
            본 약관은 다양한 서비스 이용과 관련하여 서비스를 제공하는 ©Newsnippet과 이를 이용하는 서비스 회원 또는 비회원과의 관계를 설명하며, 
            아울러 여러분의 Newsnippet 서비스 이용에 도움이 될 수 있는 유익한 정보를 포함하고 있습니다.
            <br>
            Newsnippet 서비스를 이용하시거나 서비스 회원으로 가입하실 경우 여러분은 본 약관 및 관련 운영 정책을 확인하거나 동의하게 되므로,
            잠시 시간을 내시어 주의 깊게 살펴봐 주시길 바랍니다.<br>
        </p>
        <h5>시사/상식 퀴즈 서비스를 즐겨보세요.</h5>
        <P>우리 서비스는 모든 서비스 이용자에게 유익하고 다양한 최근 시사/상식 내용을 기반으로 하여 퀴즈형태로 학습할 수 있는 서비스를 제공하고 있으며,
            최신 동향에 민감한 분야 종사자 또는 관린 지식을 필요로 하는 사용자가 우리 서비스를 통해 시사 내용을 학습함으로서 실제로 활용할 수 있는 가치 있는 정보를 얻을 수 있도록 합니다.
            <br>
        </P>
        <h5>회원으로 가입하시면 Newsnippet 서비스를 보다 편리하게 이용할 수 있습니다.</h5>
        <p>여러분은 본 약관을 읽고 동의하신 후 회원 가입을 신청하실 수 있으며, 우리 서비스는 이에 대한 승낙을 통해 회원 가입 절차를 완료하고, 
        여러분께 우리 서비스 이용 계정(이하 '계정')을 부여합니다.<br>
        계정이란 회원이 Newsnippet 서비스에 로그인한 이후 이용하는 각종 서비스 이용 이력을 회원 별로 관리하기 위해 설정한 회원 식별 단위를 말합니다.<br>
        회원은 자신의 계정을 통해 좀 더 다양한 서비스를 보다 편리하게 이용할 수 있습니다.<br>
        </p>
        <h5>여러분의 개인정보를 소중히 보호합니다.</h5>
        <p>Newsnippet은 서비스의 원할한 제공을 위하여 회원이 동의한 목적과 범위 내에서만 개인정보를 수집 이용하며, 개인정보 보호 관련 법령에 따라 안전하게 관리하고 있습니다. <br>
            Newsnippet은 여러분이 서비스를 이용하기 위해 일정 기간 동안 로그인 혹은 접속한 기록이 없는 경우, 서비스 내 알림 또는 기타 적절한 전자적 수단을 통해 사전에 안내해 드린 후 여러분의 정보를 파기하거나 분리 보관할 수 있으며,
            만약 이로 인하여 서비스 제공을 위해 필수적 정보가 부족해질 경우 부득이 관련 서비스 이용계약을 해지할 수 있습니다.<br> 
        </p>
        <h5>Newsnippet 서비스 이용과 관련하여 몇 가지 주의사항이 있습니다.</h5>
        <p>Newsnippet은 여러분이 서비스를 자유롭고 유익하게 이용할 수 있도록 최선을 다하고 있습니다. 
            다만, 여러분이 Newsnippet 서비스를 보다 안전하게 이용하고 Newsnippet 서비스에서 여러분의 권리가 존중되고 보호받으려면 여러분의 도움과 협조가 필요합니다.<br>
            여러분의 안전한 서비스 이용과 권리 보호를 위해 부득이 아래와 같은 경우 여러분의 서비스 이용이 제한이 될 수 있으므로, 이에 대한 확인 및 준수를 요청드립니다.<br>
        </p>
        <ul>
            <li>회원 가입 시 이름, 생년월일, 휴대전화번호 등의 정보를 허위로 기재해서는 안 됩니다. 회원 계정에 등록된 정보는 항상 정확한 최신 정보가 유지될 수 있도록 관리해 주세요.
                자신의 계정을 다른 사람에게 판매, 양도, 대여 또는 담보로 제공하거나 다른 사람에게 그 사용을 허락해서는 안됩니다. 아울러 자신의 계정이 아닌 타인의 계정을 무단으로 사용해서는 안 됩니다. 
            </li>
            <br>
            <li>자동화된 수단을 활용하는 등 Newsnippet 서비스의 기능을 비정상적으로 이용하여 Newsnippet 각 개별 서비스의 제공 취지와 부합하지 않는 활동은 다른 이용자들의 정상적인 Newsnippet 서비스 이용에 불편을 초래하고 더 나아가 Newsnippet의 원활한 서비스 제공을 방해하므로 역시 제한될 수 있습니다.                 
            </li>
            <br>
            <li>
                Newsnippet의 사전 허락 없이 자동화된 수단(예: 매크로 프로그램, 로봇(봇), 스파이더, 스크래퍼 등)을 이용하여 Newsnippet 서비스 회원으로 가입을 시도 또는 가입하거나, 
                Newsnippet 서비스에 로그인을 시도 또는 로그인하거나, 실제 이용을 전제로 하는 Newsnippet 서비스의 제공 취지에 부합하지 않는 방식으로 Newsnippet 서비스를 이용하거나 
                이와 같은 Newsnippet 서비스에 대한 어뷰징(남용) 행위를 막기 위한 Newsnippet의 기술적 조치를 무력화하려는 일체의 행위(예: IP를 지속적으로 바꿔가며 접속하는 행위, Captcha를 외부 솔루션 등을 통해 우회하거나 무력화 하는 행위 등)를 시도해서는 안 됩니다.
            </li>
            <br>
            <li>
                Newsnippet의 동의 없이 자동화된 수단에 의해 Newsnippet 서비스 또는 이에 포함된 소프트웨어를 복사, 수정할 수 없으며, 이를 판매, 양도, 대여 또는 담보로 제공하거나 타인에게 그 이용을 허락해서는 안 됩니다. 
                Newsnippet 서비스에 포함된 소프트웨어를 역 설계, 소스코드 추출 시도, 복제, 분해, 모방, 기타 변형하는 등의 행위도 금지됩니다.(다만, 오픈소스에 해당되는 경우 그 자체 조건에 따릅니다.) 그 밖에 바이러스나 기타 악성 코드를 업로드하거나 Newsnippet 서비스의 원할한 운영을 방해할 목적으로 서비스 기능을 비정상적으로 이용하는 행위 역시 금지됩니다.
            </li>
            <br>
        </ul>
        <h5>언제든지 Newsnippet 서비스 이용계약을 해지하실 수 있습니다.</h5>
        <p>Newsnippet에게는 사용자를 떠나 보내는 일이 너무 슬프고 안타까운 일이지만, 회원은 언제든지 Newsnippet 서비스 이용계약 해지를 신청하여 회원에서 탈퇴할 수 있으며, 이 경우 Newsnippet은 관련 법령 등이 정하는 바에 따라 이를 지체 없이 처리하겠습니다.<br>
           Newsnippet 서비스 이용계약이 해지되면, 관련 법령 및 개인정보처리방침에 따라 Newsnippet가 해당 회원의 정보를 보유할 수 있는 경우를 제외하고, 해당 회원 계정에 부속된 모든 데이터는 소멸됨과 동시에 복구할 수 없게 됩니다.<br> 
        </p>
        <h5>서비스 중단 또는 변경 시 꼭 알려드리겠습니다.</h5>
        <p>Newsnippet은 연중 무휴, 1일 24시간 안정적으로 서비스를 제공하기 위해 최선을 다하고 있지만, 컴퓨터 및 서버 등 정보통신설비의 보수점검, 교체 또는 고장, 통신두절 등 운영상 상당한 이유가 있는 경우 부득이 서비스의 전부 또는 일부를 중단할 수 있습니다.<br>
           한편, Newsnippet 서비스 운영 또는 개선을 위해 상당한 필요성이 있는 경우 서비스의 전부 또는 일부를 수정, 변경 또는 종료할 수 있습니다. 무료로 제공되는 서비스의 전부 또는 일부를 수정, 변경 또는 종료하게 된 경우 관련 법령에 특별한 규정이 없는 한 별도의 보상을 하지 않습니다.<br>
           이 경우 Newsnippet은 예측 가능한 경우 상당기간 전에 이를 안내하며, 만약 예측 불가능한 경우라면 사후 지체 없이 상세히 설명하고 안내 드리겠습니다. 
           또한 서비스 중단의 경우에는 여러분 자신의 콘텐츠를 백업할 수 있도록 합리적이고 충분한 기회를 제공하도록 하겠습니다.<br>        
        </p>
        <h5>주요 사항을 잘 안내하고 여러분의 소중한 의견에 귀 기울이겠습니다.</h5>
        <p>Newsnippet은 서비스 이용에 필요한 주요사항을 적시에 잘 안내해 드릴 수 있도록 힘쓰겠습니다. 회원에게 통지를 하는 경우 서비스 내 알림 또는 기타 적절한 전자적 수단을 통해 개별적으로 알려드릴 것이며,
           다만 회원 전체에 대한 통지가 필요한 경우엔 초기 화면에 관련 내용을 게시하도록 하겠습니다.<br>
           Newsnippet은 여러분의 소중한 의견에 귀 기울이겠습니다. 여러분은 언제든지 개발자의 이메일을 통해 서비스 이용과 관련된 의견이나 개선사항을 전달할 수 있으며, Newsnippet은 합리적 범위 내에서 가능한 그 처리과정 및 결과를 여러분께 전달할 수 있도록 하겠습니다. 
        </p>
    </div>

</template>

<style scoped>
.index {
    padding: 40px; 
    background-color: #F4F3F6;
}


h2, h5 {
    font-weight: bold;  
    color: #393B63;   
}

h5 {
    border-top: 2px solid #CCCCCC; 
    padding-top: 20px; 
}

</style>